package com.samul.javaсorelessons.lesson4;

//9. Дана длина ребра куба. Найти площадь грани, площадь полной поверхности и объем этого куба.

public class SelfStudyTask9 {

	public static void main(String[] args) {
		double a = 10;
		
		System.out.println("Площадь грани равна: " + a * a);
		System.out.println("Площадь полной поверхности равна: " + a * a * 6);
		System.out.println("Объем куба равен: " + a * a * a);

	}

}
